wisteria-1c/Конфигурация/Catalogs/ХранилищеШаблоновРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХранилищеШаблоновРМК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловиеВыводаСекцииШаблонаРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСравненияЗначенийРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСравнения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеУсловияВыводаШаблонаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ХранилищеШаблоновРМК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имя поля из доступных полей компоновки данных.
//
Функция ИмяПоляВШаблоне(Знач ИмяПоля) Экспорт
	
	ИмяПоля = СтрЗаменить(ИмяПоля, ".DeletionMark", ".ПометкаУдаления");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".Owner", ".Владелец");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".Code", ".Код");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".Parent", ".Родитель");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".Predefined", ".Предопределенный");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".IsFolder", ".ЭтоГруппа");
	ИмяПоля = СтрЗаменить(ИмяПоля, ".Description", ".Наименование");
	Возврат ИмяПоля;
	
КонецФункции

Функция ИмяПараметраШтрихкод() Экспорт
	
	Возврат "Штрихкод";
	
КонецФункции

// Функция-конструктор данных заполнения хранилища шаблонов РМК
// 
// Возвращаемое значение:
//  Структура:
//   * НоваяСсылка - СправочникСсылка.ХранилищеШаблоновРМК - Ссылка, которая будет назначена при записи нового объекта
//   * Наименование - Строка - Наименование шаблона чека
//   * Шаблон - ХранилищеЗначения - содержится структура с параметрами, используемыми в шаблоне чека
//   * СхемаКомпоновкиДанных - ХранилищеЗначения - содержится СхемаКомпоновкиДанных используемая для заполнения шаблона чека
//   * Условия - ТаблицаЗначений - условия применяемые в шаблоне чека
//
Функция ДанныеЗаполненияХранилищаШаблоновРМК() Экспорт
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("НоваяСсылка", Неопределено);
	ДанныеЗаполнения.Вставить("Наименование", "");
	ДанныеЗаполнения.Вставить("Шаблон", Неопределено);
	ДанныеЗаполнения.Вставить("СхемаКомпоновкиДанных", Неопределено);
	ДанныеЗаполнения.Вставить("Условия", Новый ТаблицаЗначений);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Создает новый элемент справочника ХранилищеШаблоновРМК и возвращает его ссылку
//
// Параметры:
//  ДанныеЗаполнения - Структура - см. Справочники.ХранилищеШаблоновРМК.ДанныеЗаполненияХранилищаШаблоновРМК()
// 
// Возвращаемое значение:
//  СправочникСсылка.ХранилищеШаблоновРМК - ссылка на вновь созданный элемент справочника ХранилищеШаблоновРМК.
//
Функция НовоеХранилищеШаблоновРМК(Знач ДанныеЗаполнения) Экспорт
	
	ОбъектШаблонЧека = Справочники.ХранилищеШаблоновРМК.СоздатьЭлемент();
	Если ДанныеЗаполнения.НоваяСсылка <> Неопределено Тогда
		ОбъектШаблонЧека.УстановитьСсылкуНового(ДанныеЗаполнения.НоваяСсылка);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ОбъектШаблонЧека, ДанныеЗаполнения, , "Условия");
	Для каждого Условие Из ДанныеЗаполнения.Условия Цикл
		НовоеУсловие = ОбъектШаблонЧека.Условия.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеУсловие, Условие);
	КонецЦикла;
	ОбъектШаблонЧека.Записать();
	
	Возврат ОбъектШаблонЧека.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
